_org/cours10-reveal.org
#+SETUPFILE: ~/.emacs.d/org-templates/base-reveal.org
#+TITLE:  Cours 10 : Matrices
#+AUTHOR: Arnaud Malapert
#+DESCRIPTION: Introduction à la programmation R.
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Introduction à la programmation R.">
#+HTML_LINK_HOME: ../introR.html
#+KEYWORDS:    computer science, teaching, programming, GNU R.
#+LANGUAGE: fr
#+OPTIONS: toc:1 num:0 H:3
#+REVEAL_HLEVEL: 2
#+OPTIONS: reveal_slide_number:t
# #+REVEAL_SLIDE_HEADER: Test
* Construction de matrices
** Création d'une matrice à partir d'un vecteur
   Tapez simplement:
   #+BEGIN_SRC R
    matrix(1:6, nrow = 2, ncol = 3)
   #+END_SRC

   #+RESULTS:
   :      [,1] [,2] [,3]
   : [1,]    1    3    5
   : [2,]    2    4    6


   #+BEGIN_SRC R
     matrix(1:6, nrow = 2, byrow = TRUE)
   #+END_SRC

   #+RESULTS:
   :      [,1] [,2] [,3]
   : [1,]    1    2    3
   : [2,]    4    5    6


   Attention, les éléments du vecteur sont recyclés
   #+BEGIN_SRC R
     matrix(1:2, nrow = 2, ncol = 2)
   #+END_SRC

   #+RESULTS:
   :      [,1] [,2]
   : [1,]    1    1
   : [2,]    2    2

** Nommage des matrices
   Nommer les deux dimensions simultanément 
   #+BEGIN_SRC R :session name
     A <- matrix(1:4, nrow = 2)
     dimnames(A) <- list(c("a", "b"), c("c", "d"))
     print(A)
   #+END_SRC
   
   #+RESULTS:
   :   c d
   : a 1 3
   : b 2 4
   ou une à la fois.
   #+BEGIN_SRC R :session name
     rownames(A) <-  c("c", "d")
     colnames(A) <- c("a", "b")
     print(A)
   #+END_SRC
   
     
   #+RESULTS:
   :   a b
   : c 1 3
   : d 2 4

   - On peut aussi récupérer ou effacer les noms avec les mêmes fonctions.
   - Il faut veiller à ce que les noms soient distincts.
*** Récupération et effacement des noms
    Récupérer les noms.
    #+BEGIN_SRC R :session name
         dimnames(A)
    #+END_SRC

    #+RESULTS:
    : [[1]]
    : [1] "c" "d"
    : 
    : [[2]]
    : [1] "a" "b"

    Effacer les noms.
   #+BEGIN_SRC R :session name
     rownames(A) <- NULL
     colnames(A) <- NULL
     print(A)
    #+END_SRC

   #+RESULTS:
   : [1] "c" "d"
   : [1] "a" "b"

*** Unicité des noms
    Le nom d'une ligne/colonne est une clé qui l'identifie.
    Il est préférable que cette clé soit unique, mais R tolère qu'elle ne le soit pas.
    

    Un nom identifie le plus petit index portant ce nom.
    #+BEGIN_SRC R :session
      A <- rbind( a=1:2, a=3:4)
      print(A["a",])
    #+END_SRC

    #+RESULTS:
    : [1] 1 2

    
    Ce comportement va engendrer quelques problèmes.    
    Par exemple, des instructions simples donneront des résultats faux.
    #+BEGIN_SRC R :session
      A <- rbind( a=1:2, a=3:4)
      print(A[rownames(A),])
    #+END_SRC

    #+RESULTS:
    :   [,1] [,2]
    : a    1    2
    : a    1    2

    /En bref, donnez des noms uniques aux lignes et colonnes de vos structures de données. Vous vous épargnerez bien des soucis./
    
** Dimensions d'une matrice
   
   - ~nrow(A)~ renvoie le nombre de lignes de ~A~.
   - ~ncol(A)~ renvoie le nombre de colonnes.
   - ~dim(A)~ renvoie toutes les dimensions.
   - ~length(A)~ renvoie le nombre d'éléments dans ~A~.
   - ~is.matrix(A)~ vérifie si ~A~ est une matrice.
   

*** Exemples
    #+BEGIN_SRC R
      A <- matrix(1:6, nrow = 2)
      nrow(A)
      ncol(A)
      dim(A)
      length(A)
      is.matrix(A)
      is.matrix(1:4)
    #+END_SRC

    #+RESULTS:
    : [1] 2
    : [1] 3
    : [1] 2 3
    : [1] 6
    : [1] TRUE
    : [1] FALSE

** Construction d'une matrice à partir d'autres matrices
   Soit ~A~ et ~B~ deux matrices, 
   #+BEGIN_SRC R :session matrix
       A <- matrix(1:4, nrow = 2)
       B <- matrix(5:8, nrow = 2, byrow = TRUE)
   #+END_SRC

    on peut les concaténer par colonnes
   #+BEGIN_SRC R :session matrix
       cbind(A,B)
   #+END_SRC

   #+RESULTS:
   :      [,1] [,2] [,3] [,4]
   : [1,]    1    3    5    6
   : [2,]    2    4    7    8
     
   ou par ligne.
   #+BEGIN_SRC R :session matrix
      rbind(A,B)
   #+END_SRC
  
   #+RESULTS:
   :      [,1] [,2]
   : [1,]    1    3
   : [2,]    2    4
   : [3,]    5    6
   : [4,]    7    8

*** Construction imbriquée et recyclage
    #+BEGIN_SRC R :session matrix
      rbind( cbind(A, 0, 0), cbind(0, 0, B))
    #+END_SRC

    #+RESULTS:
    :      [,1] [,2] [,3] [,4]
    : [1,]    1    3    0    0
    : [2,]    2    4    0    0
    : [3,]    0    0    5    6
    : [4,]    0    0    7    8


    #+BEGIN_SRC R :session matrix
      rbind( 0, cbind(0, A, 0, B, 0), 0)    
    #+END_SRC

    #+RESULTS:
    :      [,1] [,2] [,3] [,4] [,5] [,6] [,7]
    : [1,]    0    0    0    0    0    0    0
    : [2,]    0    1    3    0    5    6    0
    : [3,]    0    2    4    0    7    8    0
    : [4,]    0    0    0    0    0    0    0

*** Travailler avec des noms est plus difficile
    
    L'argument ~deparse.level~ contrôle la construction des noms de la matrice à partir de ceux des composants.
    #+BEGIN_SRC R :session deparse
      dd <- 10
      rbind(1:3, c = 2, "a++" = 10, dd, deparse.level = 0) # middle 2 rownames
    #+END_SRC

    #+RESULTS:
    :     [,1] [,2] [,3]
    :        1    2    3
    : c      2    2    2
    : a++   10   10   10
    :       10   10   10

    #+BEGIN_SRC R :session deparse
      rbind(1:3, c = 2, "a++" = 10, dd, deparse.level = 1) # 3 rownames (default)
    #+END_SRC

    #+RESULTS:
    :     [,1] [,2] [,3]
    :        1    2    3
    : c      2    2    2
    : a++   10   10   10
    : dd    10   10   10

    #+BEGIN_SRC R :session deparse
      rbind(1:3, c = 2, "a++" = 10, dd, deparse.level = 2) # 4 rownames
    #+END_SRC

    #+RESULTS:
    :     [,1] [,2] [,3]
    : 1:3    1    2    3
    : c      2    2    2
    : a++   10   10   10
    : dd    10   10   10
* Accès et modifications 
** Accès aux éléments 

   - On utilise l'opérateur ~[]~.
   - Par convention, on référence les lignes avant les colonnes.
   - On peut accéder aux éléments par leur /index/.
   - On peut aussi accéder aux éléments par leur /noms/.


*** Soit la matrice ~A~
    #+BEGIN_SRC R :session get
      A <- matrix(1:6, nrow = 2)
      rownames(A) <- c("a", "b")
      colnames(A) <- c("c", "d", "e")
      print(A)
     #+END_SRC

    #+RESULTS:
    :   c d e
    : a 1 3 5
    : b 2 4 6
  
*** Accès par index
    Accès à un élément.
    #+BEGIN_SRC R :session get
      A[1,2]
    #+END_SRC

    #+RESULTS:
    : [1] 3


    Accès à une ligne.
    #+BEGIN_SRC R :session get
      A[1,]
    #+END_SRC

    #+RESULTS:
    : c d e 
    : 1 3 5


    Accès à une colonne.
    #+BEGIN_SRC R :session get
      A[,1]
    #+END_SRC

    #+RESULTS:
    : a b 
    : 1 2


    En combinant, on peut extraire une sous-matrice.
    #+BEGIN_SRC R :session get
      A[1:2,2:3]
    #+END_SRC

    #+RESULTS:
    :   d e
    : a 3 5
    : b 4 6
