_org/cours10-reveal.html
<!DOCTYPE html>
<html lang="fr">
<head>
<meta charset="utf-8"/>
<title>Cours 10 : Matrices</title>
<meta name="author" content="(Arnaud Malapert)"/>
<meta name="description" content="Introduction à la programmation R."/>
<meta name="keywords" content="computer science, teaching, programming, GNU R."/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/league.css" id="theme"/>
<link rel="stylesheet" href="./local-reveal.css"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
<meta name="description" content="Introduction à la programmation R.">
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>Cours 10 : Matrices</h1>
<h2>Arnaud Malapert</h2>
<h2><a href="mailto:arnaud.malapert@unice.fr">arnaud.malapert@unice.fr</a></h2>
<h2></h2>
</section>
<section id="table-of-contents">
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-orgheadline10">Construction de matrices</a></li>
<li><a href="#/slide-orgheadline31">Accès et modifications</a></li>
<li><a href="#/slide-orgheadline36">Opérations sur les matrices</a></li>
<li><a href="#/slide-orgheadline41">Fonctions prédéfinies</a></li>
<li><a href="#/slide-orgheadline47">Exemples simples</a></li>
<li><a href="#/slide-orgheadline48">Matrices multidimensionnelles</a></li>
<li><a href="#/slide-orgheadline56">Quelques exemples de systèmes linéaires en économie</a></li>
<li><a href="#/slide-orgheadline57"><span class="todo TODO">TODO</span> Construction de matrice complexe</a></li>
</ul>
</div>
</div>
</section>

<section>
<section id="slide-orgheadline10">
<h2 id="orgheadline10">Construction de matrices</h2>
<div class="outline-text-2" id="text-orgheadline10">
</div></section>
</section>
<section>
<section id="slide-orgheadline1">
<h3 id="orgheadline1">Création d&rsquo;une matrice à partir d&rsquo;un vecteur</h3>
<p>
Tapez simplement:
</p>
<div class="org-src-container">

<pre><code class="R">matrix(1:6, nrow = 2, ncol = 3)
</code></pre>
</div>

<pre class="example">
     [,1] [,2] [,3]
[1,]    1    3    5
[2,]    2    4    6
</pre>


<div class="org-src-container">

<pre><code class="R">matrix(1:6, nrow = 2, byrow = TRUE)
</code></pre>
</div>

<pre class="example">
     [,1] [,2] [,3]
[1,]    1    2    3
[2,]    4    5    6
</pre>


<p>
Attention, les éléments du vecteur sont recyclés
</p>
<div class="org-src-container">

<pre><code class="R">matrix(1:2, nrow = 2, ncol = 2)
</code></pre>
</div>

<pre class="example">
     [,1] [,2]
[1,]    1    1
[2,]    2    2
</pre>

</section>
</section>
<section>
<section id="slide-orgheadline4">
<h3 id="orgheadline4">Nommage des matrices</h3>
<p>
Nommer les deux dimensions simultanément 
</p>
<div class="org-src-container">

<pre><code class="R">A <- matrix(1:4, nrow = 2)
dimnames(A) <- list(c("a", "b"), c("c", "d"))
print(A)
</code></pre>
</div>

<pre class="example">
  c d
a 1 3
b 2 4
</pre>
<p>
ou une à la fois.
</p>
<div class="org-src-container">

<pre><code class="R">rownames(A) <-  c("c", "d")
colnames(A) <- c("a", "b")
print(A)
</code></pre>
</div>


<pre class="example">
  a b
c 1 3
d 2 4
</pre>

<ul>
<li>On peut aussi récupérer ou effacer les noms avec les mêmes fonctions.</li>
<li>Il faut veiller à ce que les noms soient distincts.</li>

</ul>
</section>
<section id="slide-orgheadline2">
<h4 id="orgheadline2">Récupération et effacement des noms</h4>
<p>
Récupérer les noms.
</p>
<div class="org-src-container">

<pre><code class="R">dimnames(A)
</code></pre>
</div>

<pre class="example">
[[1]]
[1] "c" "d"

[[2]]
[1] "a" "b"
</pre>

<p>
Effacer les noms.
</p>
<div class="org-src-container">

<pre><code class="R">rownames(A) <- NULL
colnames(A) <- NULL
print(A)
</code></pre>
</div>

<pre class="example">
[1] "c" "d"
[1] "a" "b"
</pre>

</section>
<section id="slide-orgheadline3">
<h4 id="orgheadline3">Unicité des noms</h4>
<p>
Le nom d&rsquo;une ligne/colonne est une clé qui l&rsquo;identifie.
Il est préférable que cette clé soit unique, mais R tolère qu&rsquo;elle ne le soit pas.
</p>


<p>
Un nom identifie le plus petit index portant ce nom.
</p>
<div class="org-src-container">

<pre><code class="R">A <- rbind( a=1:2, a=3:4)
print(A["a",])
</code></pre>
</div>

<pre class="example">
[1] 1 2
</pre>


<p>
Ce comportement va engendrer quelques problèmes.    
Par exemple, des instructions simples donneront des résultats faux.
</p>
<div class="org-src-container">

<pre><code class="R">A <- rbind( a=1:2, a=3:4)
print(A[rownames(A),])
</code></pre>
</div>

<pre class="example">
  [,1] [,2]
a    1    2
a    1    2
</pre>

<p>
<i>En bref, donnez des noms uniques aux lignes et colonnes de vos structures de données. Vous vous épargnerez bien des soucis.</i>
</p>

</section>
</section>
<section>
<section id="slide-orgheadline6">
<h3 id="orgheadline6">Dimensions d&rsquo;une matrice</h3>
<ul>
<li><code>nrow(A)</code> renvoie le nombre de lignes de <code>A</code>.</li>
<li><code>ncol(A)</code> renvoie le nombre de colonnes.</li>
<li><code>dim(A)</code> renvoie toutes les dimensions.</li>
<li><code>length(A)</code> renvoie le nombre d&rsquo;éléments dans <code>A</code>.</li>
<li><code>is.matrix(A)</code> vérifie si <code>A</code> est une matrice.</li>

</ul>


</section>
<section id="slide-orgheadline5">
<h4 id="orgheadline5">Exemples</h4>
<div class="org-src-container">

<pre><code class="R">A <- matrix(1:6, nrow = 2)
nrow(A)
ncol(A)
dim(A)
length(A)
is.matrix(A)
is.matrix(1:4)
</code></pre>
</div>

<pre class="example">
[1] 2
[1] 3
[1] 2 3
[1] 6
[1] TRUE
[1] FALSE
</pre>

</section>
</section>
<section>
<section id="slide-orgheadline9">
<h3 id="orgheadline9">Construction d&rsquo;une matrice à partir d&rsquo;autres matrices</h3>
<p>
Soit <code>A</code> et <code>B</code> deux matrices, 
</p>
<div class="org-src-container">

<pre><code class="R">A <- matrix(1:4, nrow = 2)
B <- matrix(5:8, nrow = 2, byrow = TRUE)
</code></pre>
</div>

<p>
on peut les concaténer par colonnes
</p>
<div class="org-src-container">

<pre><code class="R">cbind(A,B)
</code></pre>
</div>

<pre class="example">
     [,1] [,2] [,3] [,4]
[1,]    1    3    5    6
[2,]    2    4    7    8
</pre>

<p>
ou par ligne.
</p>
<div class="org-src-container">

<pre><code class="R">rbind(A,B)
</code></pre>
</div>

<pre class="example">
     [,1] [,2]
[1,]    1    3
[2,]    2    4
[3,]    5    6
[4,]    7    8
</pre>

</section>
<section id="slide-orgheadline7">
<h4 id="orgheadline7">Construction imbriquée et recyclage</h4>
<div class="org-src-container">

<pre><code class="R">rbind( cbind(A, 0, 0), cbind(0, 0, B))
</code></pre>
</div>

<pre class="example">
     [,1] [,2] [,3] [,4]
[1,]    1    3    0    0
[2,]    2    4    0    0
[3,]    0    0    5    6
[4,]    0    0    7    8
</pre>


<div class="org-src-container">

<pre><code class="R">rbind( 0, cbind(0, A, 0, B, 0), 0)
</code></pre>
</div>

<pre class="example">
     [,1] [,2] [,3] [,4] [,5] [,6] [,7]
[1,]    0    0    0    0    0    0    0
[2,]    0    1    3    0    5    6    0
[3,]    0    2    4    0    7    8    0
[4,]    0    0    0    0    0    0    0
</pre>

</section>
<section id="slide-orgheadline8">
<h4 id="orgheadline8">Travailler avec des noms est plus difficile</h4>
<p>
L&rsquo;argument <code>deparse.level</code> contrôle la construction des noms de la matrice à partir de ceux des composants.
</p>
<div class="org-src-container">

<pre><code class="R">dd <- 10
rbind(1:3, c = 2, "a++" = 10, dd, deparse.level = 0) # middle 2 rownames
</code></pre>
</div>

<pre class="example">
    [,1] [,2] [,3]
       1    2    3
c      2    2    2
a++   10   10   10
      10   10   10
</pre>

<div class="org-src-container">

<pre><code class="R">rbind(1:3, c = 2, "a++" = 10, dd, deparse.level = 1) # 3 rownames (default)
</code></pre>
</div>

<pre class="example">
    [,1] [,2] [,3]
       1    2    3
c      2    2    2
a++   10   10   10
dd    10   10   10
</pre>

<div class="org-src-container">

<pre><code class="R">rbind(1:3, c = 2, "a++" = 10, dd, deparse.level = 2) # 4 rownames
</code></pre>
</div>

<pre class="example">
    [,1] [,2] [,3]
1:3    1    2    3
c      2    2    2
a++   10   10   10
dd    10   10   10
</pre>
</section>
</section>
<section>
<section id="slide-orgheadline31">
<h2 id="orgheadline31">Accès et modifications</h2>
<div class="outline-text-2" id="text-orgheadline31">
</div></section>
</section>
<section>
<section id="slide-orgheadline16">
<h3 id="orgheadline16">Accès aux éléments</h3>
<ul>
<li>On utilise l&rsquo;opérateur <code>[]</code>.</li>
<li>Par convention, on référence les lignes avant les colonnes.</li>
<li>On peut accéder aux éléments par leur <i>index</i>.</li>
<li>On peut aussi accéder aux éléments par leur <i>noms</i>.</li>

</ul>


</section>
