_org/cours10-reveal.org
*** Accès par nom
      Accès à un élément.
    #+BEGIN_SRC R :session get
      A["a","e"]
    #+END_SRC

    #+RESULTS:
    : [1] 5


    Accès à une ligne.
    #+BEGIN_SRC R :session get
      A["a",]
    #+END_SRC

    #+RESULTS:
    : c d e 
    : 1 3 5


    Accès à une colonne.
    #+BEGIN_SRC R :session get
      A[,"c"]
    #+END_SRC

    #+RESULTS:
    : a b 
    : 1 2


    En combinant, on peut extraire une sous-matrice.
    #+BEGIN_SRC R :session get
      A[c("a", "b"),c("d","e")]
    #+END_SRC

    #+RESULTS:
    :   d e
    : a 3 5
    : b 4 6

*** Accès à un élément non existant
    Une erreur est levé quand on essaie d'accéder à un élément non existant.
    #+BEGIN_SRC R
      A <- matrix(1:4, nrow = 2)
      A[3,3]
    #+END_SRC

    #+RESULTS:
    : Error in A[3, 3] : indice hors limites


    Une erreur est aussi levée pour une liste, 
    #+BEGIN_SRC R
       x <- list(1,2,3,4)
       x[[5]]
    #+END_SRC

    #+RESULTS:
    : Error in x[[5]] : indice hors limites


    mais pas pour un vecteur.
    #+BEGIN_SRC R
      x <- 1:4
      x[5]
    #+END_SRC
    
    #+RESULTS:
    : [1] NA

*** TODO Accès par projection sur un vecteur
** Modification de matrices 
   
   - On modifie la matrice en combinant l'opérateur ~[]~ et une affectation ~<-~.
   - Une erreur est déclenchée si :
     - Des éléments n'existent pas.
     - Les dimensions des opérandes gauche et droit de l'affectation sont différents.
     

   Par exemple, on peut modifier un seul élément.
   #+BEGIN_SRC R :session matrix
     A <- matrix(1:6, nrow = 2)
     rownames(A) <- c("a", "b")
     A["a",1] <- 0
     print(A)
   #+END_SRC

   #+RESULTS:
   :   [,1] [,2] [,3]
   : a    0    3    5
   : b    2    4    6

** Affectation d'une ligne ou d'une colonne
   On peut affecter une même valeur à tous les éléments
   #+BEGIN_SRC R :session matrix
     A["a", ] <- 0
     print(A)
   #+END_SRC
   #+RESULTS:
   :   [,1] [,2] [,3]
   : a    0    0    0
   : b    2    4    6

   ou des valeurs différentes.
   #+BEGIN_SRC R :session matrix
     A[, 2] <- 7:8
     print(A)
   #+END_SRC

   #+RESULTS:
   :   [,1] [,2] [,3]
   : a    0    7    0
   : b    2    8    6

   Si les éléments n'existent pas, une erreur est levée.
   #+BEGIN_SRC R :session matrix
     A[3, ] <- 0
   #+END_SRC

   #+RESULTS:
   : Error in `[<-`(`*tmp*`, 3, , value = 0) : indice hors limites


*** Modification d'une sous-matrice
    
    #+BEGIN_SRC R :session matrix
      A[c("a","b"), 2:3] <- matrix(9:12, nrow = 2)
      print(A)
    #+END_SRC

    #+RESULTS:
    :   [,1] [,2] [,3]
    : a    0    9   11
    : b    2   10   12

** Suppression d'une ligne ou d'une colonne

   /On va utiliser des indices négatifs dans l'opérateur ~[]~./
   
   Soit la matrice ~A~.
   #+BEGIN_SRC R :session matrix
     A <- matrix(1:6, nrow = 2)
     rownames(A) <- c("a", "b")
   #+END_SRC

   #+RESULTS:

   
   On peut "supprimer" une ligne,
   #+BEGIN_SRC R :session matrix
     A[-1, ] 
   #+END_SRC
   #+RESULTS:
   : [1] 2 4 6

   ou des colonnes,
   #+BEGIN_SRC R :session matrix
     A[,-(1:2)] 
   #+END_SRC

   #+RESULTS:
   : a b 
   : 5 6
   
   mais pas une sous-matrice.
   #+BEGIN_SRC R :session matrix
     A[-(1:2),-(1:2)]
   #+END_SRC

   #+RESULTS:
   : integer(0)
 
   
   Que remarquez vous ? 

***  La variable ~A~ n'est pas modifée

    En fait, l'opérateur ~[]~ accéde à une vue de la matrice.
    #+BEGIN_SRC R :session matrix
      invisible(A[-1, ]) 
      print(A)
    #+END_SRC


    #+RESULTS:
    :   [,1] [,2] [,3]
    : a    1    3    5
    : b    2    4    6


    Il faut utiliser l'opérateur ~<-~ pour réaffecter la variable ~A~.
    #+BEGIN_SRC R :session matrix
      A <- A[-1, ] 
      print(A)
    #+END_SRC
    

    #+RESULTS:
    : [1] 2 4 6

*** TODO Et les noms ?

** Pré-allocation de mémoire
    
    - Prévoir l’espace mémoire nécessaire avant l’exécution du programme, en spécifiant la quantité nécessaire dans le code source.
    - Au chargement du programme en mémoire, juste avant l’exécution, l’espace réservé devient alors accessible.

    
    Souvent, la pré-allocation d'une matrice est :
     - une matrice spéciale ;
     - ou une matrice aléatoire.
    
*** Matrices spéciales

    La matrice nulle ne contient que des 0. 
     #+BEGIN_SRC R
     matrix(0, nrow = 2, ncol = 3)
     #+END_SRC

     La matrice unité n contient que des 1. 
     #+BEGIN_SRC R
     matrix(1, nrow = 2, ncol = 3)
     #+END_SRC

     La matrice identité.
     #+BEGIN_SRC R
       diag(2)
     #+END_SRC

     Les matrices diagonales.
     #+BEGIN_SRC R
       diag(1:3)
     #+END_SRC

     #+RESULTS:
     :      [,1] [,2] [,3]
     : [1,]    1    0    0
     : [2,]    0    2    0
     : [3,]    0    0    3

*** Matrices Diagonales

    Une matrice carrée avec les elements de ~x~ dans la diagonale principale.
    #+BEGIN_SRC R
      diag(1:3)
    #+END_SRC

    #+RESULTS:
    :      [,1] [,2] [,3]
    : [1,]    1    0    0
    : [2,]    0    2    0
    : [3,]    0    0    3

    Un vecteur avec les éléments de la diagonale principale.
    #+BEGIN_SRC R
     diag(matrix(1:9, nrow = 3))
    #+END_SRC

    #+RESULTS:
    : [1] 1 5 9

    Une matrice carrée ~k*k~ si ~k~ est un scalaire.
    #+BEGIN_SRC R
      diag(3)
    #+END_SRC

    #+RESULTS:
    :      [,1] [,2] [,3]
    : [1,]    1    0    0
    : [2,]    0    1    0
    : [3,]    0    0    1

*** Matrices aléatoires
   On crée un vecteur de nombres aléatoires qu'on transforme en matrice.
**** Nombres flottants aléatoires suivant une distribution uniforme sur l’intervalle $[0,1]$.
     #+BEGIN_SRC R
       matrix(runif(4), nrow = 2) 
     #+END_SRC

     #+RESULTS:
     :           [,1]      [,2]
     : [1,] 0.1883247 0.1547749
     : [2,] 0.8733712 0.8415802

**** Nombres entiers aléatoires suivant une distribution uniforme sur l’intervalle $[1,10]$.
     #+BEGIN_SRC R
       matrix(sample(10, 4), nrow = 2) 
     #+END_SRC

     #+RESULTS:
     :      [,1] [,2]
     : [1,]   10    1
     : [2,]    3    4
