_org/cours10-reveal.html
<section id="slide-orgheadline11">
<h4 id="orgheadline11">Soit la matrice <code>A</code></h4>
<div class="org-src-container">

<pre><code class="R">A <- matrix(1:6, nrow = 2)
rownames(A) <- c("a", "b")
colnames(A) <- c("c", "d", "e")
print(A)
</code></pre>
</div>

<pre class="example">
  c d e
a 1 3 5
b 2 4 6
</pre>

</section>
<section id="slide-orgheadline12">
<h4 id="orgheadline12">Accès par index</h4>
<p>
Accès à un élément.
</p>
<div class="org-src-container">

<pre><code class="R">A[1,2]
</code></pre>
</div>

<pre class="example">
[1] 3
</pre>


<p>
Accès à une ligne.
</p>
<div class="org-src-container">

<pre><code class="R">A[1,]
</code></pre>
</div>

<pre class="example">
c d e 
1 3 5
</pre>


<p>
Accès à une colonne.
</p>
<div class="org-src-container">

<pre><code class="R">A[,1]
</code></pre>
</div>

<pre class="example">
a b 
1 2
</pre>


<p>
En combinant, on peut extraire une sous-matrice.
</p>
<div class="org-src-container">

<pre><code class="R">A[1:2,2:3]
</code></pre>
</div>

<pre class="example">
  d e
a 3 5
b 4 6
</pre>
</section>
<section id="slide-orgheadline13">
<h4 id="orgheadline13">Accès par nom</h4>
<p>
Accès à un élément.
</p>
<div class="org-src-container">

<pre><code class="R">A["a","e"]
</code></pre>
</div>

<pre class="example">
[1] 5
</pre>


<p>
Accès à une ligne.
</p>
<div class="org-src-container">

<pre><code class="R">A["a",]
</code></pre>
</div>

<pre class="example">
c d e 
1 3 5
</pre>


<p>
Accès à une colonne.
</p>
<div class="org-src-container">

<pre><code class="R">A[,"c"]
</code></pre>
</div>

<pre class="example">
a b 
1 2
</pre>


<p>
En combinant, on peut extraire une sous-matrice.
</p>
<div class="org-src-container">

<pre><code class="R">A[c("a", "b"),c("d","e")]
</code></pre>
</div>

<pre class="example">
  d e
a 3 5
b 4 6
</pre>

</section>
<section id="slide-orgheadline14">
<h4 id="orgheadline14">Accès à un élément non existant</h4>
<p>
Une erreur est levé quand on essaie d&rsquo;accéder à un élément non existant.
</p>
<div class="org-src-container">

<pre><code class="R">A <- matrix(1:4, nrow = 2)
A[3,3]
</code></pre>
</div>

<pre class="example">
Error in A[3, 3] : indice hors limites
</pre>


<p>
Une erreur est aussi levée pour une liste, 
</p>
<div class="org-src-container">

<pre><code class="R">x <- list(1,2,3,4)
x[[5]]
</code></pre>
</div>

<pre class="example">
Error in x[[5]] : indice hors limites
</pre>


<p>
mais pas pour un vecteur.
</p>
<div class="org-src-container">

<pre><code class="R">x <- 1:4
x[5]
</code></pre>
</div>

<pre class="example">
[1] NA
</pre>

</section>
<section id="slide-orgheadline15">
<h4 id="orgheadline15"><span class="todo TODO">TODO</span> Accès par projection sur un vecteur</h4>
</section>
</section>
<section>
<section id="slide-orgheadline17">
<h3 id="orgheadline17">Modification de matrices</h3>
<ul>
<li>On modifie la matrice en combinant l&rsquo;opérateur <code>[]</code> et une affectation <code>&lt;-</code>.</li>
<li>Une erreur est déclenchée si :
<ul>
<li>Des éléments n&rsquo;existent pas.</li>
<li>Les dimensions des opérandes gauche et droit de l&rsquo;affectation sont différents.</li>

</ul></li>

</ul>


<p>
Par exemple, on peut modifier un seul élément.
</p>
<div class="org-src-container">

<pre><code class="R">A <- matrix(1:6, nrow = 2)
rownames(A) <- c("a", "b")
A["a",1] <- 0
print(A)
</code></pre>
</div>

<pre class="example">
  [,1] [,2] [,3]
a    0    3    5
b    2    4    6
</pre>

</section>
</section>
<section>
<section id="slide-orgheadline19">
<h3 id="orgheadline19">Affectation d&rsquo;une ligne ou d&rsquo;une colonne</h3>
<p>
On peut affecter une même valeur à tous les éléments
</p>
<div class="org-src-container">

<pre><code class="R">A["a", ] <- 0
print(A)
</code></pre>
</div>
<pre class="example">
  [,1] [,2] [,3]
a    0    0    0
b    2    4    6
</pre>

<p>
ou des valeurs différentes.
</p>
<div class="org-src-container">

<pre><code class="R">A[, 2] <- 7:8
print(A)
</code></pre>
</div>

<pre class="example">
  [,1] [,2] [,3]
a    0    7    0
b    2    8    6
</pre>

<p>
Si les éléments n&rsquo;existent pas, une erreur est levée.
</p>
<div class="org-src-container">

<pre><code class="R">A[3, ] <- 0
</code></pre>
</div>

<pre class="example">
Error in `[&lt;-`(`*tmp*`, 3, , value = 0) : indice hors limites
</pre>


</section>
<section id="slide-orgheadline18">
<h4 id="orgheadline18">Modification d&rsquo;une sous-matrice</h4>
<div class="org-src-container">

<pre><code class="R">A[c("a","b"), 2:3] <- matrix(9:12, nrow = 2)
print(A)
</code></pre>
</div>

<pre class="example">
  [,1] [,2] [,3]
a    0    9   11
b    2   10   12
</pre>

</section>
</section>
<section>
<section id="slide-orgheadline22">
<h3 id="orgheadline22">Suppression d&rsquo;une ligne ou d&rsquo;une colonne</h3>
<p>
<i>On va utiliser des indices négatifs dans l&rsquo;opérateur <code>[]</code>.</i>
</p>

<p>
Soit la matrice <code>A</code>.
</p>
<div class="org-src-container">

<pre><code class="R">A <- matrix(1:6, nrow = 2)
rownames(A) <- c("a", "b")
</code></pre>
</div>

<p>
On peut &laquo;&nbsp;supprimer&nbsp;&raquo; une ligne,
</p>
<div class="org-src-container">

<pre><code class="R">A[-1, ]
</code></pre>
</div>
<pre class="example">
[1] 2 4 6
</pre>

<p>
ou des colonnes,
</p>
<div class="org-src-container">

<pre><code class="R">A[,-(1:2)]
</code></pre>
</div>

<pre class="example">
a b 
5 6
</pre>

<p>
mais pas une sous-matrice.
</p>
<div class="org-src-container">

<pre><code class="R">A[-(1:2),-(1:2)]
</code></pre>
</div>

<pre class="example">
integer(0)
</pre>


<p>
Que remarquez vous ? 
</p>

</section>
<section id="slide-orgheadline20">
<h4 id="orgheadline20">La variable <code>A</code> n&rsquo;est pas modifée</h4>
<p>
En fait, l&rsquo;opérateur <code>[]</code> accéde à une vue de la matrice.
</p>
<div class="org-src-container">

<pre><code class="R">invisible(A[-1, ]) 
print(A)
</code></pre>
</div>


<pre class="example">
  [,1] [,2] [,3]
a    1    3    5
b    2    4    6
</pre>


<p>
Il faut utiliser l&rsquo;opérateur <code>&lt;-</code> pour réaffecter la variable <code>A</code>.
</p>
<div class="org-src-container">

<pre><code class="R">A <- A[-1, ] 
print(A)
</code></pre>
</div>


<pre class="example">
[1] 2 4 6
</pre>

</section>
<section id="slide-orgheadline21">
<h4 id="orgheadline21"><span class="todo TODO">TODO</span> Et les noms ?</h4>

</section>
</section>
<section>
<section id="slide-orgheadline28">
<h3 id="orgheadline28">Pré-allocation de mémoire</h3>
<ul>
<li>Prévoir l’espace mémoire nécessaire avant l’exécution du programme, en spécifiant la quantité nécessaire dans le code source.</li>
<li>Au chargement du programme en mémoire, juste avant l’exécution, l’espace réservé devient alors accessible.</li>

</ul>


<p>
Souvent, la pré-allocation d&rsquo;une matrice est :
</p>
<ul>
<li>une matrice spéciale ;</li>
<li>ou une matrice aléatoire.</li>

</ul>

</section>
<section id="slide-orgheadline23">
<h4 id="orgheadline23">Matrices spéciales</h4>
<p>
La matrice nulle ne contient que des 0. 
</p>
<div class="org-src-container">

<pre><code class="R">matrix(0, nrow = 2, ncol = 3)
</code></pre>
</div>

<p>
La matrice unité n contient que des 1. 
</p>
<div class="org-src-container">

<pre><code class="R">matrix(1, nrow = 2, ncol = 3)
</code></pre>
</div>

<p>
La matrice identité.
</p>
<div class="org-src-container">

<pre><code class="R">diag(2)
</code></pre>
</div>

<p>
Les matrices diagonales.
</p>
<div class="org-src-container">

<pre><code class="R">diag(1:3)
</code></pre>
</div>

<pre class="example">
     [,1] [,2] [,3]
[1,]    1    0    0
[2,]    0    2    0
[3,]    0    0    3
</pre>

</section>
<section id="slide-orgheadline24">
<h4 id="orgheadline24">Matrices Diagonales</h4>
<p>
Une matrice carrée avec les elements de <code>x</code> dans la diagonale principale.
</p>
<div class="org-src-container">

<pre><code class="R">diag(1:3)
</code></pre>
</div>

<pre class="example">
     [,1] [,2] [,3]
[1,]    1    0    0
[2,]    0    2    0
[3,]    0    0    3
</pre>

<p>
Un vecteur avec les éléments de la diagonale principale.
</p>
<div class="org-src-container">

<pre><code class="R">diag(matrix(1:9, nrow = 3))
</code></pre>
</div>

<pre class="example">
[1] 1 5 9
</pre>

<p>
Une matrice carrée <code>k*k</code> si <code>k</code> est un scalaire.
</p>
<div class="org-src-container">

<pre><code class="R">diag(3)
</code></pre>
</div>

<pre class="example">
     [,1] [,2] [,3]
[1,]    1    0    0
[2,]    0    1    0
[3,]    0    0    1
</pre>

</section>
<section id="slide-orgheadline27">
<h4 id="orgheadline27">Matrices aléatoires</h4>
<p>
On crée un vecteur de nombres aléatoires qu&rsquo;on transforme en matrice.
</p>
<ul class="org-ul"><li><a id="orgheadline25"></a>Nombres flottants aléatoires suivant une distribution uniforme sur l’intervalle \([0,1]\).<br  /><div class="org-src-container">

<pre><code class="R">matrix(runif(4), nrow = 2)
</code></pre>
</div>

<pre class="example">
          [,1]      [,2]
[1,] 0.1883247 0.1547749
[2,] 0.8733712 0.8415802
</pre></li>

<li><a id="orgheadline26"></a>Nombres entiers aléatoires suivant une distribution uniforme sur l’intervalle \([1,10]\).<br  /><div class="org-src-container">

<pre><code class="R">matrix(sample(10, 4), nrow = 2)
</code></pre>
</div>

<pre class="example">
     [,1] [,2]
[1,]   10    1
[2,]    3    4
</pre></li></ul>
</section>
</section>
