_org/cours10-reveal.org
** Exemple : super-diagonales et sous-diagonales

   Soit une matrice carrée, on appelle :
   - /diagonale principale/
   - /sous-diagonale/ : une diagonale en dessous de la diagonale principale
   - /super-diagonale/ : une diagonale au-dessus de la diagonale principale

     
   Écrire une fonction ~sdiag(n, k)~ qui renvoie une matrice nulle sauf la k-ème diagonale qui est égale à 1. 

    #+BEGIN_SRC R :session sdiag
      sdiag(4, 1)
    #+END_SRC

    #+RESULTS:
    :      [,1] [,2] [,3] [,4]
    : [1,]    0    1    0    0
    : [2,]    0    0    1    0
    : [3,]    0    0    0    1
    : [4,]    0    0    0    0
   
*** Fonction ~sdiag~

      #+BEGIN_SRC R :results none :session sdiag
        sdiag <- function(n, k = 0) {
          ## Preallocate result matrix
          res <- matrix(0, nrow = n, ncol = n)
          ## Column of the k-th diagonal for each row
          c1 <- max(1,1+k)
          c2 <- min(n,n+k)
          if(c1 <= c2) {
            ## For each line, add element if the super-diagonal column exists
            for(i in c1:c2) {
              res[i-k, i] <- 1
            }
          }
          return(res)
        }
      #+END_SRC


    #+BEGIN_SRC R :session sdiag
      sdiag(4, -2)
    #+END_SRC

    #+RESULTS:
    :      [,1] [,2] [,3] [,4]
    : [1,]    0    0    0    0
    : [2,]    0    0    0    0
    : [3,]    1    0    0    0
    : [4,]    0    1    0    0
* Opérations sur les matrices
** Opérations membre à membre 
    
     - ~A+B~ : addition 
     - ~A-B~ : soustraction 
     - ~A*B~ : multiplication 
     - ~A/B~ : division 
     - ~A**n~ : puissance ~n~
#+BEGIN_SRC R
  A <- matrix(1:4, nrow = 2)
  print(A*2)
  print(A*A)

#+END_SRC

#+RESULTS:
:      [,1] [,2]
: [1,]    2    6
: [2,]    4    8
:      [,1] [,2]
: [1,]    1    9
: [2,]    4   16

   
** Algèbre matricielle 

   - ~t(A)~	transposée de A
   - ~A %*% B~ multiplication de matrices.
   - ~A %o% B~ ou ~outer(A,B)~ 	produit externe de matrices, renvoie un ~array~ de dimension ~c(dim(A), dim(B))~ obtenu par toutes les combinaisons de multiplication possibles 
   - ~crossprod(A,B)~, ~crossprod(A)~ produit en croix (~t(A') %*% B~ and ~t(A') %*% A~).
   - ~det(A)~ renvoie le déterminant d'une matrice carrée.
   - ~eigen(A)~ calcul de valeurs propres et vecteurs propres d'une matrice carrée (diagonalisation de matrices).
   - ~solve(A, b)~ 	renvoie un vecteur ~x~ solution de l'équation ~b = Ax~ (i.e., A^-1 b)
   - ~solve(A)~ 	renvoie l'inverse de ~A~ où ~A~ est une matrice carrée.

*** Exemple : table de multiplication
    #+BEGIN_SRC R
      x <- 1:9
      names(x) <- x
      x %o% x
    #+END_SRC

    #+RESULTS:
    #+begin_example
      1  2  3  4  5  6  7  8  9
    1 1  2  3  4  5  6  7  8  9
    2 2  4  6  8 10 12 14 16 18
    3 3  6  9 12 15 18 21 24 27
    4 4  8 12 16 20 24 28 32 36
    5 5 10 15 20 25 30 35 40 45
    6 6 12 18 24 30 36 42 48 54
    7 7 14 21 28 35 42 49 56 63
    8 8 16 24 32 40 48 56 64 72
    9 9 18 27 36 45 54 63 72 81
#+end_example
*** Exemple : rotation dans le plan euclidien
  
    Construction de la matrice d'une rotation d'un angle de $\phi = \frac{\pi}{3}$:
    #+BEGIN_SRC R :session matrix
      phi <- pi/3
      R <- matrix( c(cos(phi), sin(phi), -sin(phi), cos(phi)), nrow=2)
      print(R)
     #+END_SRC

    #+RESULTS:
    :           [,1]       [,2]
    : [1,] 0.5000000 -0.8660254
    : [2,] 0.8660254  0.5000000

    L'image du point (1,1) par une rotation de $\phi$ est
    #+BEGIN_SRC R :session matrix
      R %*% c(1, 1)
    #+END_SRC

    #+RESULTS:
    :            [,1]
    : [1,] -0.3660254
    : [2,]  1.3660254


    Calculer l'image d'un ensemble de points
    #+BEGIN_SRC R :session matrix
      P <- matrix(runif(6), nrow = 2)
      R %*% P
    #+END_SRC

    #+RESULTS:
    :            [,1]       [,2]      [,3]
    : [1,] 0.07489988 -0.2198921 0.3097203
    : [2,] 0.94190313  0.7151099 0.8003908

* Fonctions prédéfinies
** Fonctions de somme
  - ~sum(A)~ somme tous les éléments de ~A~.
  - ~rowSums(A)~ renvoie un vecteur avec les sommes des lignes ~A~.
  - ~colSums(A)~ renvoie un vecteur avec les sommes des colonnes de ~A~.

** Fonctions statistiques

  - ~mean(A)~ calcule la moyenne des éléments de ~A~.
  - ~rowMeans(A)~ renvoie un vecteur avec les moyennes des lignes ~A~.
  - ~colMeans(A)~ renvoie un vecteur avec les moyennes des colonnes de ~A~.
    
** Fonctions minimum et maximum

  - ~min(A)~ le plus petit élément de ~A~
  - ~max(A)~ le plus grand élément de ~A~

** Fonction de balayage d'une matrice numérique
   Soustraire la moyenne de chaque ligne à chaque élément.
   #+BEGIN_SRC R :session matrix
     A <- matrix(1:4, nrow = 2)
     sweep(A, 1, rowMeans(A))
   #+END_SRC

   #+RESULTS:
   :      [,1] [,2]
   : [1,]   -1    1
   : [2,]   -1    1


   Normaliser une matrice pour obtenir une moyenne nulle sur chaque colonne.
   #+BEGIN_SRC R :session matrix
     scale(A, center = TRUE, scale = FALSE)
   #+END_SRC

   #+RESULTS:
   :      [,1] [,2]
   : [1,] -0.5 -0.5
   : [2,]  0.5  0.5
   : attr(,"scaled:center")
   : [1] 1.5 3.5

   Normaliser une matrice pour obtenir une moyenne nulle et un écart-type de 1 sur chaque ligne.
   #+BEGIN_SRC R :session matrix
     t( scale(t(A), center = TRUE, scale = TRUE) )
   #+END_SRC

   #+RESULTS:
   :            [,1]      [,2]
   : [1,] -0.7071068 0.7071068
   : [2,] -0.7071068 0.7071068
   : attr(,"scaled:center")
   : [1] 2 3
   : attr(,"scaled:scale")
   : [1] 1.414214 1.414214
* Exemples simples
** Produit des lignes/colonnes
   Le produit des lignes/colonnes de ~A~ n'existe pas, mais on peut le programmer avec des boucles ou ~apply~.
    #+BEGIN_SRC R
      rowProd <- function(A) apply(A, 1, prod)
      colProd <- function(A) apply(A, 2, prod)

      A <- matrix(1:4, nrow = 2)
      print(rowProd(A))
      print(colProd(A))
    #+END_SRC

    #+RESULTS:
    : [1] 3 8
    : [1]  2 12

** Calcul de moyennes

**** Génération d'une matrice ~notes~ telle que chaque ligne représente les trois notes d'un étudiant.
    #+BEGIN_SRC R :session matrix
      n <- 4
      notes <- matrix(sample(0:20, 3*n), ncol = 3)
      colnames(notes) <- c("CC", "TP", "CT")
      print(notes)
    #+END_SRC

    #+RESULTS:
    :      CC TP CT
    : [1,]  3  2 14
    : [2,] 10 20  5
    : [3,]  9  8  0
    : [4,] 12 17  7

**** Calculer les notes finales des étudiants avec les coefficients suivants : $40\%$ CC ; $20\%$ TP ; $40\%$ CT.
         
    #+BEGIN_SRC R :session matrix
      coefs <- c(0.4, 0.2, 0.4)
      notes <- cbind(notes, NF = as.vector(notes %*% coefs) )
      print(notes)
    #+END_SRC

    #+RESULTS:
    :      CC TP CT   NF
    : [1,]  3  2 14  7.2
    : [2,] 10 20  5 10.0
    : [3,]  9  8  0  5.2
    : [4,] 12 17  7 11.0

