_org/cours10-reveal.html
<section>
<section id="slide-orgheadline30">
<h3 id="orgheadline30">Exemple : super-diagonales et sous-diagonales</h3>
<p>
Soit une matrice carrée, on appelle :
</p>
<ul>
<li><i>diagonale principale</i></li>
<li><i>sous-diagonale</i> : une diagonale en dessous de la diagonale principale</li>
<li><i>super-diagonale</i> : une diagonale au-dessus de la diagonale principale</li>

</ul>


<p>
Écrire une fonction <code>sdiag(n, k)</code> qui renvoie une matrice nulle sauf la k-ème diagonale qui est égale à 1. 
</p>

<div class="org-src-container">

<pre><code class="R">sdiag(4, 1)
</code></pre>
</div>

<pre class="example">
     [,1] [,2] [,3] [,4]
[1,]    0    1    0    0
[2,]    0    0    1    0
[3,]    0    0    0    1
[4,]    0    0    0    0
</pre>

</section>
<section id="slide-orgheadline29">
<h4 id="orgheadline29">Fonction <code>sdiag</code></h4>
<div class="org-src-container">

<pre><code class="R">sdiag <- function(n, k = 0) {
  ## Preallocate result matrix
  res <- matrix(0, nrow = n, ncol = n)
  ## Column of the k-th diagonal for each row
  c1 <- max(1,1+k)
  c2 <- min(n,n+k)
  if(c1 <= c2) {
    ## For each line, add element if the super-diagonal column exists
    for(i in c1:c2) {
      res[i-k, i] <- 1
    }
  }
  return(res)
}
</code></pre>
</div>


<div class="org-src-container">

<pre><code class="R">sdiag(4, -2)
</code></pre>
</div>

<pre class="example">
     [,1] [,2] [,3] [,4]
[1,]    0    0    0    0
[2,]    0    0    0    0
[3,]    1    0    0    0
[4,]    0    1    0    0
</pre>
</section>
</section>
<section>
<section id="slide-orgheadline36">
<h2 id="orgheadline36">Opérations sur les matrices</h2>
<div class="outline-text-2" id="text-orgheadline36">
</div></section>
</section>
<section>
<section id="slide-orgheadline32">
<h3 id="orgheadline32">Opérations membre à membre</h3>
<ul>
<li><code>A+B</code> : addition</li>
<li><code>A-B</code> : soustraction</li>
<li><code>A*B</code> : multiplication</li>
<li><code>A/B</code> : division</li>
<li><code>A**n</code> : puissance <code>n</code></li>

</ul>
<div class="org-src-container">

<pre><code class="R">A <- matrix(1:4, nrow = 2)
print(A*2)
print(A*A)
</code></pre>
</div>

<pre class="example">
     [,1] [,2]
[1,]    2    6
[2,]    4    8
     [,1] [,2]
[1,]    1    9
[2,]    4   16
</pre>


</section>
</section>
<section>
<section id="slide-orgheadline35">
<h3 id="orgheadline35">Algèbre matricielle</h3>
<ul>
<li><code>t(A)</code> transposée de A</li>
<li><code>A %*% B</code> multiplication de matrices.</li>
<li><code>A %o% B</code> ou <code>outer(A,B)</code>  produit externe de matrices, renvoie un <code>array</code> de dimension <code>c(dim(A), dim(B))</code> obtenu par toutes les combinaisons de multiplication possibles</li>
<li><code>crossprod(A,B)</code>, <code>crossprod(A)</code> produit en croix (<code>t(A') %*% B</code> and <code>t(A') %*% A</code>).</li>
<li><code>det(A)</code> renvoie le déterminant d&rsquo;une matrice carrée.</li>
<li><code>eigen(A)</code> calcul de valeurs propres et vecteurs propres d&rsquo;une matrice carrée (diagonalisation de matrices).</li>
<li><code>solve(A, b)</code>  renvoie un vecteur <code>x</code> solution de l&rsquo;équation <code>b = Ax</code> (i.e., A<sup>-1</sup> b)</li>
<li><code>solve(A)</code>  renvoie l&rsquo;inverse de <code>A</code> où <code>A</code> est une matrice carrée.</li>

</ul>

</section>
<section id="slide-orgheadline33">
<h4 id="orgheadline33">Exemple : table de multiplication</h4>
<div class="org-src-container">

<pre><code class="R">x <- 1:9
names(x) <- x
x %o% x
</code></pre>
</div>

<pre class="example">
  1  2  3  4  5  6  7  8  9
1 1  2  3  4  5  6  7  8  9
2 2  4  6  8 10 12 14 16 18
3 3  6  9 12 15 18 21 24 27
4 4  8 12 16 20 24 28 32 36
5 5 10 15 20 25 30 35 40 45
6 6 12 18 24 30 36 42 48 54
7 7 14 21 28 35 42 49 56 63
8 8 16 24 32 40 48 56 64 72
9 9 18 27 36 45 54 63 72 81
</pre>
</section>
<section id="slide-orgheadline34">
<h4 id="orgheadline34">Exemple : rotation dans le plan euclidien</h4>
<p>
Construction de la matrice d&rsquo;une rotation d&rsquo;un angle de \(\phi = \frac{\pi}{3}\):
</p>
<div class="org-src-container">

<pre><code class="R">phi <- pi/3
R <- matrix( c(cos(phi), sin(phi), -sin(phi), cos(phi)), nrow=2)
print(R)
</code></pre>
</div>

<pre class="example">
          [,1]       [,2]
[1,] 0.5000000 -0.8660254
[2,] 0.8660254  0.5000000
</pre>

<p>
L&rsquo;image du point (1,1) par une rotation de \(\phi\) est
</p>
<div class="org-src-container">

<pre><code class="R">R %*% c(1, 1)
</code></pre>
</div>

<pre class="example">
           [,1]
[1,] -0.3660254
[2,]  1.3660254
</pre>


<p>
Calculer l&rsquo;image d&rsquo;un ensemble de points
</p>
<div class="org-src-container">

<pre><code class="R">P <- matrix(runif(6), nrow = 2)
R %*% P
</code></pre>
</div>

<pre class="example">
           [,1]       [,2]      [,3]
[1,] 0.07489988 -0.2198921 0.3097203
[2,] 0.94190313  0.7151099 0.8003908
</pre>

</section>
</section>
<section>
<section id="slide-orgheadline41">
<h2 id="orgheadline41">Fonctions prédéfinies</h2>
<div class="outline-text-2" id="text-orgheadline41">
</div></section>
</section>
<section>
<section id="slide-orgheadline37">
<h3 id="orgheadline37">Fonctions de somme</h3>
<ul>
<li><code>sum(A)</code> somme tous les éléments de <code>A</code>.</li>
<li><code>rowSums(A)</code> renvoie un vecteur avec les sommes des lignes <code>A</code>.</li>
<li><code>colSums(A)</code> renvoie un vecteur avec les sommes des colonnes de <code>A</code>.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgheadline38">
<h3 id="orgheadline38">Fonctions statistiques</h3>
<ul>
<li><code>mean(A)</code> calcule la moyenne des éléments de <code>A</code>.</li>
<li><code>rowMeans(A)</code> renvoie un vecteur avec les moyennes des lignes <code>A</code>.</li>
<li><code>colMeans(A)</code> renvoie un vecteur avec les moyennes des colonnes de <code>A</code>.</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgheadline39">
<h3 id="orgheadline39">Fonctions minimum et maximum</h3>
<ul>
<li><code>min(A)</code> le plus petit élément de <code>A</code></li>
<li><code>max(A)</code> le plus grand élément de <code>A</code></li>

</ul>

</section>
</section>
<section>
<section id="slide-orgheadline40">
<h3 id="orgheadline40">Fonction de balayage d&rsquo;une matrice numérique</h3>
<p>
Soustraire la moyenne de chaque ligne à chaque élément.
</p>
<div class="org-src-container">

<pre><code class="R">A <- matrix(1:4, nrow = 2)
sweep(A, 1, rowMeans(A))
</code></pre>
</div>

<pre class="example">
     [,1] [,2]
[1,]   -1    1
[2,]   -1    1
</pre>


<p>
Normaliser une matrice pour obtenir une moyenne nulle sur chaque colonne.
</p>
<div class="org-src-container">

<pre><code class="R">scale(A, center = TRUE, scale = FALSE)
</code></pre>
</div>

<pre class="example">
     [,1] [,2]
[1,] -0.5 -0.5
[2,]  0.5  0.5
attr(,"scaled:center")
[1] 1.5 3.5
</pre>

<p>
Normaliser une matrice pour obtenir une moyenne nulle et un écart-type de 1 sur chaque ligne.
</p>
<div class="org-src-container">

<pre><code class="R">t( scale(t(A), center = TRUE, scale = TRUE) )
</code></pre>
</div>

<pre class="example">
           [,1]      [,2]
[1,] -0.7071068 0.7071068
[2,] -0.7071068 0.7071068
attr(,"scaled:center")
[1] 2 3
attr(,"scaled:scale")
[1] 1.414214 1.414214
</pre>
</section>
</section>
<section>
<section id="slide-orgheadline47">
<h2 id="orgheadline47">Exemples simples</h2>
<div class="outline-text-2" id="text-orgheadline47">
</div></section>
</section>
<section>
<section id="slide-orgheadline42">
<h3 id="orgheadline42">Produit des lignes/colonnes</h3>
<p>
Le produit des lignes/colonnes de <code>A</code> n&rsquo;existe pas, mais on peut le programmer avec des boucles ou <code>apply</code>.
</p>
<div class="org-src-container">

<pre><code class="R">rowProd <- function(A) apply(A, 1, prod)
colProd <- function(A) apply(A, 2, prod)

A <- matrix(1:4, nrow = 2)
print(rowProd(A))
print(colProd(A))
</code></pre>
</div>

<pre class="example">
[1] 3 8
[1]  2 12
</pre>

</section>
</section>
<section>
<section id="slide-orgheadline46">
<h3 id="orgheadline46">Calcul de moyennes</h3>
<div class="outline-text-3" id="text-orgheadline46">
</div><ul class="org-ul"><li><a id="orgheadline43"></a>Génération d&rsquo;une matrice <code>notes</code> telle que chaque ligne représente les trois notes d&rsquo;un étudiant.<br  /><div class="org-src-container">

<pre><code class="R">n <- 4
notes <- matrix(sample(0:20, 3*n), ncol = 3)
colnames(notes) <- c("CC", "TP", "CT")
print(notes)
</code></pre>
</div>

<pre class="example">
     CC TP CT
[1,]  3  2 14
[2,] 10 20  5
[3,]  9  8  0
[4,] 12 17  7
</pre></li>

<li><a id="orgheadline44"></a>Calculer les notes finales des étudiants avec les coefficients suivants : \(40\%\) CC ; \(20\%\) TP ; \(40\%\) CT.<br  /><div class="org-src-container">

<pre><code class="R">coefs <- c(0.4, 0.2, 0.4)
notes <- cbind(notes, NF = as.vector(notes %*% coefs) )
print(notes)
</code></pre>
</div>

<pre class="example">
     CC TP CT   NF
[1,]  3  2 14  7.2
[2,] 10 20  5 10.0
[3,]  9  8  0  5.2
[4,] 12 17  7 11.0
</pre></li>

</section>
