_org/cours10-reveal.org
*** Calcul de moyennes (suite)
    Pour chaque note, afficher les statistiques de la fonction ~summary~.

      #+BEGIN_SRC R :session matrix
       summary(notes)
      #+END_SRC   

      #+RESULTS:
      :        CC             TP              CT              NF       
      :  Min.   : 3.0   Min.   : 2.00   Min.   : 0.00   Min.   : 5.20  
      :  1st Qu.: 7.5   1st Qu.: 6.50   1st Qu.: 3.75   1st Qu.: 6.70  
      :  Median : 9.5   Median :12.50   Median : 6.00   Median : 8.60  
      :  Mean   : 8.5   Mean   :11.75   Mean   : 6.50   Mean   : 8.35  
      :  3rd Qu.:10.5   3rd Qu.:17.75   3rd Qu.: 8.75   3rd Qu.:10.25  
      :  Max.   :12.0   Max.   :20.00   Max.   :14.00   Max.   :11.00


* Matrices multidimensionnelles
   Une matrice multidimensionnelle est un ~array~ en R défini par ses données et ses dimensions.
   Un ~array~ est un vecteur avec des attributs supplémentaires donnant ses.
   #+BEGIN_SRC R :session matrix
     array(1:12, dim = c(2,3,2))
   #+END_SRC

   #+RESULTS:
   #+begin_example
   , , 1

        [,1] [,2] [,3]
   [1,]    1    3    5
   [2,]    2    4    6

   , , 2

        [,1] [,2] [,3]
   [1,]    7    9   11
   [2,]    8   10   12
#+end_example

   On peut effectuer une permutation des dimensions d'un ~array~
   #+BEGIN_SRC R
    aperm( array(1:12, dim = c(2,3,2)), c(3,1,2))
   #+END_SRC

   #+RESULTS:
   #+begin_example
   , , 1

        [,1] [,2]
   [1,]    1    2
   [2,]    7    8

   , , 2

        [,1] [,2]
   [1,]    3    4
   [2,]    9   10

   , , 3

        [,1] [,2]
   [1,]    5    6
   [2,]   11   12

#+end_example

* Quelques exemples de systèmes linéaires en économie
  Exemples tirés de [[file:cours10/cours_proglin_eco.pdf]["Systèmes linéaires en économie"]] du [[http://math.unice.fr/~walter/L1MASS/L1MASS_AlgLin][cours d'algèbre linéaire en L1 MASS]]. 

** TODO Avantages fiscaux de dons aux oeuvres de charité 

   Source : C. Simon et L. Blume, Mathématiques  pour  économistes, trad. fran ̧caise, De Boeck, Bruxelles, 1998.

   Une entreprise fait un bénéfice avant impôts de 100 000 F. Elle s’est engagée à verser 10% de son bénéfice net d’impôts à la caisse de secours de la Croix Rouge. 
   Elle doit payer un impôt local pour la taxe professionnelle égal à 5% de son bénéfice (après donation à la Croix Rouge) et un impôt national sur les sociétés de 40% de son bénéfice (après que la donation et l’impôt local aient été prélevés). 

   Quels sont les montants de l’impôt local, de l’impôt national, et de la donation à la Croix Rouge versés par l’entreprise ?


*** Système linéaire associé au problème
    Ecrivons $C$, $L$, $N$ pour les montants respectifs de la contribution à la Croix Rouge, de l’impôt local, et de l’impôt national.
    Le bénéfice après impôts donne une équation :
    \[
    10* C + N + L =  100000 \Leftrightarrow \\
    C + 0,1L + 0,1N = 10 000
    \]
    L’impôt local est 5% du bénéfice net de la donation, ce qui nous donne une équation :
    \[
    C + 0,05L = 5 000.
    \]
    L’impôt national est de 40% du bénéfice après déduction de C et de L :
    \[
    0,4C + 0,4L + N = 40 000.
    \]
 
*** Bénéfice après impôts et contribution
    On construit les matrices du système linéaire ~Ax=b~.
   #+BEGIN_SRC R :session fisc
     A <- cbind( C = c(1, 0.05, 0.4), L = c(0.1, 1, 0.4), N = c(0.1, 0, 1) )
     b <- c(10000, 5000, 40000)
     print(A)
     print(b)
   #+END_SRC

   #+RESULTS:
   :         C   L   N
   : [1,] 1.00 0.1 0.1
   : [2,] 0.05 1.0 0.0
   : [3,] 0.40 0.4 1.0
   : [1] 10000  5000 40000

   
   On résout le système linéaire.
   #+BEGIN_SRC R :session fisc
     x1 <- solve(A,b)
     print(round(x1,1))
   #+END_SRC

   #+RESULTS:
   :       C       L       N 
   :  5956.1  4702.2 35736.7

   On calcule le bénéfice après impôts et contribution.
   #+BEGIN_SRC R :session fisc
     benef1 <- 100000 - sum(x1)
     print(benef1)
   #+END_SRC

   
   #+RESULTS:
   : [1] 53605.02

*** Bénéfice après impôts sans contribution
    Il suffit de remplacer la première contrainte (ligne) par la contrainte $C=0$.en imposant que la contribution soit égale à 0.
   #+BEGIN_SRC R :results none :session fisc 
     A[1,] <- c(1, 0, 0)
     b[1] <- 0
   #+END_SRC

   On résout à nouveau le système linéaire et on calcule le bénéfice après impôts sans contribution.
   #+BEGIN_SRC R :session fisc
     x2 <- solve(A,b)
     print(x2)
     benef2 <- 100000 - sum(x2)
     print(benef2)
   #+END_SRC

   #+RESULTS:
   :     C     L     N 
   :     0  5000 38000
   : [1] 57000

   Finalement, le montant de la contribution après déduction d'impôts est  
   #+BEGIN_SRC R :session fisc
     cat(sprintf("%.1f soit %.1f%% du montant total.\n",
                 benef2-benef1, 
                 round(100*(benef2-benef1)/x1["C"],1)))
   #+END_SRC

   #+RESULTS:
   : 3395.0 soit 57.0% du montant total.

** STARTED Prix dans une économie de subsistance 

     Source : B. Guerrien, Algèbre Linéaire pour économistes, 4ème éd., Economica, Paris, 1997.

     Considérons une économie qui ne produit que ce qui est nécessaire pour continuer à subsister. 
     Supposons qu'elle ne comporte que trois biens produits selons les relation suivantes :
      - 240 quintaux de blé + 12 tonnes de fer + 18 porcs \rightarrow 450 quintaux de blé
      - 90 quintaux de blé + 6 tonnes de fer + 12 porcs \rightarrow 21 tonnes de fer
      - 120 quintaux de blé + 3 tonnes de fer + 30 porcs \rightarrow 60 porcs


      Les porcs et le blé ne servent pas directement à produire le fer. Plutôt ils nourissent les travailleurs nécessaire pour produire le fer. 
      Mais on les intègrera dans le modèle comme des biens nécessaires pour la production du fer.
     
      Notons que cette économie ne dégage aucun surplus pour la consommation. 
      Les 450 quintaux de blé produits sont totalement utilisés dans la production : 240 quintaux servent dans la production du blé, 90 quintaux dans la production du fer, et 120 quintaux dans l'élevage des porcs. Il est de même pour les 21 tonnes de fer et les 60 porcs.
     
  

*** Solution
       Soit $B$, $F$, et $P$ les prix respectifs d'un quintal de blé, d'une tonne de fer, et d'un porc.
       Comme l'économie ne dégage aucun surplus, elle n'a pas le moyen de gagner un bénéfice de sa production globalement. Donc un bénéfice dans un secteur serait compensé par un déficit dans un autre, qui augmenterait ses prix, et les prix s'évolueront vers un équilibre où les dépenses de chaque secteur sont égales à ses recettes. 
       Cela se traduit en un système de trois équations
       \[
       240B + 12F + 18P = 450B \\
       90B + 6F + 12P = 21F \\
       120B + 3F + 30P = 60P 
       \]



  Résoudre ce système linéaire pour trouver les prix d'équilibre dans cette économie.

  #+BEGIN_SRC R
    A <- cbind(B = c(-210, 90, 120), F = c(12, -15, 3), P = c(18, 12, -30))
    b <- numeric(3)
    solve(A, b)
  #+END_SRC

  #+RESULTS:

  Pour résoudre ce problème, on peut par exemple utiliser la fonction ~ginv~ du package ~MASS~ ou utiliser sa propre méthode d'[[http://biol09.biol.umontreal.ca/Bio6077/Exercice_inversion.pdf][inversion]].

  Des modèles similaires mais plus compliqués servent pour l'analyse des prix dans les
  économies avec surplus (modèle de Sraffa).

