_org/cours10-reveal.org
** STARTED [[http://math.unice.fr/~walter/L1MASS/Cours_matrice_entrees.pdf][Matrices d'entrées/sorties]]

Source : [[http://math.unice.fr/~walter/L1MASS/Cours_matrice_entrees.pdf][Cours sur les matrices d'entrées/sorties]]

Léontief a utilisé l'analyse d'entrée-sortie pour étudier l'économie des Etats-Unis en 1958.
Il a divisé l'économie en 81 secteurs et les a regroupés en six groupes distincts. 
Nous allons traiter chacune des six familles comme des industries séparées afin de simplifier notre présentation. 
Ces six industries sont listées ci-dessous :

| Abbrev. | Secteur                             | Exemples                                               |
|---------+-------------------------------------+--------------------------------------------------------|
| FN      | Produits finis non métalliques      | Peausserie, mobilier, aliments                         |
| FM      | Produits finis métalliques          | Appareils de construction, appareils ménagers          |
| BM      | Métal brut                          | Produits d'exploitation minière et d'atelier d'usinage |
| BN      | Produits semi-finis non métalliques | Verre, bois, textile, et produits pour l'élevage       |
| E       | Energie                             | Charbon, pétrole, électricité, gaz                     |
| S       | Services                            | Services publics, transports, immobilier               |


Leurs demandes intermédiaires de facteurs sont données dans le tableau suivant. 
Les unités sont des millions de dollars. 
Les nombres dans chaque colonne représente les demandes faites (chiffrés en fractions de 1 million de dollars) par le secteur correspondant sur lui-même et les autres secteurs.
pour produire 1 million de dollars de ses produits. 
Donc 0,173 en ligne 3 et colonne 2 veut dire que la production d'une valeur de 1 million de dollars de produits finis métalliques nécessite une dépense de 173 000 dollars en métal brut.

#+BEGIN_SRC R :results none :session matrix
  A <- read.table( text =  
        "FN  FM     BM     BN     E      S    
         0.170  0.004  0.000  0.029  0.000  0.008
         0.003  0.295  0.018  0.002  0.004  0.016
         0.025  0.173  0.460  0.007  0.011  0.007
         0.348  0.037  0.021  0.403  0.011  0.048
         0.007  0.001  0.039  0.025  0.358  0.025
         0.120  0.074  0.104  0.123  0.173  0.234", header= TRUE)
  rownames(A) <- colnames(A)
#+END_SRC

Le tableau suivant donne les estimations de Léontief pour les demandes finales dans l'économie des Etats-Unis de 1958 (en millions de dollars). 
Le problème est de déterminer combien d'unités ont dû être produites dans chacun des six secteurs afin de faire fonctionner l'économie des Etats-Unis
en 1958.

#+BEGIN_SRC R :results none :session matrix
  b <- c(99640, 75548, 14444, 33501, 23527, 263985)
  names(b) <- colnames(A)
  rbind(names(b), b)
#+END_SRC

Pour résoudre ce problème, nous traitons les deux derniers tableaux comme une matrice de technologie ~A~ et un vecteur colonne de demandes finales ~b~. 
L'objectif est de résoudre ~(I − A)x = c~ pour une matrice de colonnes de sorties ~x~ : ~x = (I − A)^-1 c~.

Nous devons calculer la matrice d'entrée-sortie nette I − A.
La matrice inverse de cette matrice d'entrées-sorties nette peut être calculée par la méthode ~solve~.

#+BEGIN_SRC R :results value :session matrix
  A.net <- diag(nrow(A)) - A
  A.inv <- solve(A.net)
  round(A.inv, digits = 3)
#+END_SRC

#+RESULTS:
| 1.234 | 0.014 | 0.007 | 0.064 | 0.006 | 0.017 |
| 0.017 | 1.436 | 0.056 | 0.014 | 0.019 | 0.032 |
| 0.078 | 0.467 | 1.878 | 0.036 | 0.044 | 0.031 |
| 0.752 | 0.133 | 0.101 | 1.741 | 0.065 | 0.123 |
| 0.061 | 0.045 |  0.13 | 0.083 | 1.578 | 0.059 |
|  0.34 | 0.236 | 0.307 | 0.315 | 0.376 | 1.349 |

Ensuite, on l'utilise pour calculer la matrice colonne des sorties brutes.
#+BEGIN_SRC R :results value :session matrix
  x <- A.inv %*% b
  rbind(rownames(x), t (round( x, digits = 0)))
#+END_SRC

#+RESULTS:
|     FN |     FM |    BM |     BN |     E |      S |
| 131033 | 120459 | 80681 | 178732 | 66929 | 431562 |


Nous concluons que, par exemple, un total de 131 161 millions de dollars de produits finis non métalliques sont nécessaires pour satisfaire à la fois les demandes intermédiaires et finales de l'économie des Etats-Unis en 1958.

* TODO Construction de matrice complexe 
  

